Revit 2026 API

# BuiltInFailuresComponentRepeaterSlotFailures Class

---

Failures related to component repeater slots.

SystemObject Autodesk.Revit.DBBuiltInFailuresComponentRepeaterSlotFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ComponentRepeaterSlotFailures
```
```vb
Public NotInheritable Class ComponentRepeaterSlotFailures
```
```cpp
public ref class ComponentRepeaterSlotFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ComponentRepeaterSlotFailures = class end
```

The BuiltInFailuresComponentRepeaterSlotFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComponentRepeaterSlot_InvalidFamilyOnReload | Reloaded family not appropriate for repeated component. |

#### Reference

Autodesk.Revit.DB Namespace